practice-for-ch-rails-first-routes-long-practice-main/practice-for-ch-rails-first-routes-long-practice-main/my_project_name/app/controllers/artworks_controller.rb

    def index
        artworks = Artwork.all
---
SELECT "artworks".* FROM "artworks"

    def create
        artwork = Artwork.new(artwork_params)
        if artwork.save
---
INSERT INTO "artworks" ("title", "artist_id", "image_url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "waffles"], ["artist_id", 2], ["image_url", "michelle.com"], ["created_at", "2023-03-09 18:23:42.540334"], ["updated_at", "2023-03-09 18:23:42.540334"]]

    def show
        incoming_wildcard = params[:id]
        artwork = Artwork.find_by(id: incoming_wildcard)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]

    def update
        incoming_wildcard = params[:id]
        artwork = Artwork.find_by(id: incoming_wildcard)
        if artwork && artwork.update(artwork_params)
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "artworks" SET "title" = $1, "updated_at" = $2 WHERE "artworks"."id" = $3  [["title", "mochiwaffle"], ["updated_at", "2023-03-09 18:27:52.823024"], ["id", 2]]

    def destroy
        incoming_wildcard = params[:id]
        artwork = Artwork.find_by(id: incoming_wildcard)
        if artwork && artwork.destroy
---
SELECT "artworks".* FROM "artworks" WHERE "artworks"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artworks" WHERE "artworks"."id" = $1  [["id", 2]]