practice-for-ch-rails-first-routes-long-practice-main/practice-for-ch-rails-first-routes-long-practice-main/my_project_name/app/controllers/artwork_shares_controller.rb

  def create
    shares = ArtworkShare.new(artwork_share_params)
    if shares.save
---
INSERT INTO "artwork_shares" ("artwork_id", "view_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["artwork_id", 1], ["view_id", 13], ["created_at", "2023-03-09 19:31:02.872011"], ["updated_at", "2023-03-09 19:31:02.872011"]]

  def destroy
    id = params[:id]
    shares = ArtworkShare.find_by(id: id)
    if shares && shares.destroy
---
SELECT "artwork_shares".* FROM "artwork_shares" WHERE "artwork_shares"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artwork_shares" WHERE "artwork_shares"."id" = $1  [["id", 2]]