practice-for-ch-rails-first-routes-long-practice-main/practice-for-ch-rails-first-routes-long-practice-main/my_project_name/app/controllers/comments_controller.rb

    def create
        comment = Comment.new(comment_params)
        if comment.save
---
INSERT INTO "comments" ("body", "author_id", "artwork_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "this is terrible"], ["author_id", 7], ["artwork_id", 4], ["created_at", "2023-03-09 23:21:37.769496"], ["updated_at", "2023-03-09 23:21:37.769496"]]

    def destroy
        id = params[:id]
        comment = Comment.find_by(id: id)
        if comment && comment.destroy
---
SELECT "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]

    def index
        user_id = params[:user_id]
        artwork_id = params[:artwork_id]
        if user_id
            comments = Comment.find_by(author_id: user_id)
            if comments
                render json: comments
            end
        elsif artwork_id
            comments = Comment.find_by(artwork_id: artwork_id)
---
SELECT "comments".* FROM "comments" WHERE "comments"."author_id" = $1 LIMIT $2  [["author_id", 7], ["LIMIT", 1]]
SELECT "comments".* FROM "comments" WHERE "comments"."artwork_id" = $1 LIMIT $2  [["artwork_id", 4], ["LIMIT", 1]]