practice-for-ch-rails-first-routes-long-practice-main/practice-for-ch-rails-first-routes-long-practice-main/my_project_name/app/controllers/users_controller.rb

  def index
    # debugger
    name = params[:search]
    user = User.where("username ILIKE '#{name}'")
    if user.empty?
      render json: user
    else
      users = User.all
---
SELECT "users".* FROM "users" WHERE (username ILIKE 'brandon')
SELECT "users".* FROM "users" WHERE (username ILIKE 'zebra')
SELECT 1 AS one FROM "users" WHERE (username ILIKE 'paul') LIMIT $1  [["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE (username ILIKE 'michelle')

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("username", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["username", "chris"], ["created_at", "2023-03-09 17:54:54.594592"], ["updated_at", "2023-03-09 17:54:54.594592"]]

  def show
    incoming_wildcard = params[:id]
    user = User.find_by(id: incoming_wildcard)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]

  def update
    incoming_wildcard = params[:id]
    user = User.find_by(id: incoming_wildcard)
    if user && user.update(user_params)
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
UPDATE "users" SET "name" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["name", "mich"], ["updated_at", "2023-03-09 00:59:27.104896"], ["id", 11]]

  def destroy
    incoming_wildcard = params[:id]
    user = User.find_by(id: incoming_wildcard)
    if user && user.destroy
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 12], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 3]]